package card;
import java.util.HashMap;

public class AcademicCard extends Card {
    public AcademicCard(int num) {
        cardNum = num;
        cards = new HashMap<>();
        cards.put(1, "학원을 다니는 직장인이라든지 자격증 시험을 준비하는 사람이라면 계속 한 가지 장소를 고수하는 것이 유리한 날입니다.\n공부를 위한 이동운은 그리 좋지 않군요.\n어디가자 모하자 놀자 등 주변에서 공부를 방해하는 유혹이 있을 수 있습니다.\n이럴땐 과감히 차단하고 원래 하고 있던 장소에서 공부에 매진하세요.\n오늘 앉게 될 그 자리가 당신의 행운 포인트 입니다.");
        cards.put(2, "시험은 다가오고 시간은 없고 해야 할 과제도 많고 봐야 할 자료도 많습니다.\n미리 앞서서 걱정이 많을 하루이지만 큰 무리는 없겠습니다.\n시험에 대비해 준비해 놓은 것이 많은 당신은 별로 두려울 이유가 없습니다.\n오히려 이런 당신의 여유로움이 결과에 긍정적인 효과를 미치는 날입니다.\n너무 결과에 연연해 하지 말고 최선을 다해 노력하십시오.\n당신은 좋은 소식을 들을 수 있을 것입니다.\n또한 나와 별 관계가 없다고 생각되는 분야에 관한 책을 읽어 보는 것도 괜찮은 하루 입니다.");
        cards.put(3, "시험에서 좋은 결과를 얻을 수 있습니다.\n평소의 노력이 현실에 반영되는 순간입니다.\n책을 잡고 혼자서 공부하는 것보다는 직접 시험을 치르는 편이 결과도 좋고 효과도 좋습니다.\n시험이라는 특수한 상황은 당신의 상태에 조정을 가합니다.\n계속되는 약간의 긴장이 당신의 뇌세포를 자극해서 평소보다 날카롭고 평소보다 정확한 사고를 하게 합니다.\n암기분야라도 개념에 대한 정리가 확실히 되어야겠습니다.\n천천히 가더라도 이해가 먼저 입니다.");
        cards.put(4, "뿌린 대로 거두는 날입니다.\n오늘은 자신의 진짜 실력을 알아볼 수 있는 기회라고나 할까요.\n너무 빡빡하게 생각하지 말고 순수하게 받아들이고 시험을 보는 것이 좋겠습니다.\n하고자 하는 의욕을 가지고 문제를 하나하나 풀어 나가다 보면 자연스럽게 좋은 점수에 대한 확신이 들 것입니다.\n당신이 출제를 바랐던 부분에서 출제되는 등의 행운이 따릅니다.\n시험이나 학업운이 무난한 하루 입니다.");
        cards.put(5, "오늘 당신이 보는 시험이 직장에 관한 시험, 그 중에서도 특히나 하위 직급에서의 승진이나 취직에 관련된 시험이라면 오늘은 당신에게 운이 따라주는 날이라고 할 수 있을 것입니다.\n다른 때보다도 시험에 임하는 컨디션은 좋을뿐더러 당신 자신의 장점과 뛰어난 점을 마음껏 보일 수 있는 결과가 될 것으로 생각됩니다.\n위축되지 말고 당신 자신의 실력을 십분 발휘할 수 있도록 노력한다면 당신이 원하는 이상으로 좋은 성과를 올릴 것이 보이는 운세입니다.");
        cards.put(6, "노력한 대가를 받을 수는 있습니다.\n그동안 당신이 공부했던 대가를 받을 수 있는 날입니다.\n당신이 원하는 목표를 이룰 수 있고, 원하는 일을 성취할 수 있는 운세입니다.\n그동안 취직 하고자 사방팔방 뛰어다니고 알아보았지만 당신에게는 소용없는 일이었습니다. 그것은 아직 때를 만나지 못했기 때문입니다.\n오늘이 바로 당신에게 다가온 그 때입니다.\n평소에 꾸준히 열심히 노력한 당신이 원하는 목표를 이룰 수 있는 운 때를 만난 것입니다.");
        cards.put(7, "오늘 당신은 별다른 무리 없이 학업에 정진할 수 있을 것이니 잠자리에 들 무렵에서는 뿌듯한 기분을 느낄 수 있을 것입니다.\n평소 유난히 당신을 괴롭히던 잡생각이나 놀고 싶다는 욕구도 오늘은 찾아볼 수 없으니 눈앞에 놓인 과제를 처리해 나가는 것에 집중할 수 있을 것이지요.\n집안일이나 교우 관계 등 공부 이외의 일로 골치를 앓고 있었다면 그 또한 오늘 어느 정도 해결이 가능할 것 같네요. 인생에서 공부는 할까 말까 하는 선택이 아닙니다.\n삶에 있어 원동력과 같은 것입니다. 끊임없이 공부하고 활용하려는 노력을 기울이세요.");
    }
}
