package card;
import java.util.HashMap;

public class LoveCard extends Card {
    public LoveCard(int num) {
        cardNum = num;
        cards = new HashMap<>();
        cards.put(1, "오늘 같은 날에는 이벤트를 준비해 보면 어떨까요?\n서로가 바쁘다는 핑계로 소홀하게 대하지 않았는지 생각해 보세요.\n상대방에 대한 자신의 감정의 변화가 없다면 행동에도 변화가 없어야 합니다.\n또한 자신의 성격이 다정다감하지 않다고 하여 상대방에게 그대로 대하고 있다면 반드시 고쳐야 합니다.\n상대방으로 하여금 불안함을 느끼게 되는 수도 있습니다.\n평소 상대방이 당신을 무뚝뚝한 사람이라 여기고 있었다면 작은, 혹은 큰 이벤트로 인해 상대방에게 결정적인 호감을 줄 수 있을 것입니다.");
        cards.put(2, "평소에 해보지 않았던 것들에 도전해 보는 것은 어떨지요.\n항상 똑같은 행동과 말은 사랑하는 사이라고 할지라도 너무 평범하기 때문에 서로에 대한 감정을 쉽게 알아차리지 못하게 할 수 도 있습니다.\n마음으로만 막연하게 도전해보고 싶었던 일이 있다면 혼자가 아닌 상대방과 함께 해보는 것은 어떨까요?\n또한 늘 상 들리곤 했던 커피숍이나 영화관 보다는 색다른 곳을 찾아 떠나 보시기 바랍니다.\n미술관도 좋을 것 같네요.\n겸사겸사 여행을 가는 것도 하나의 전환점이 될 수 있습니다.");
        cards.put(3, "바라만 보고 있어도 애정이 크게 싹트는 날이니 걱정할 것이 없습니다.\n서로를 생각하는 마음이 존재한다면 어떤 일을 하고 어디서 만나든 행복하기만 할 것입니다.\n자신의 마음이 상대방에게로만 향해 있으니 상대방의 마음 역시 자신에게로만 향해있는 이치입니다.\n또한 만남에 앞서 준비해야 할 것은 짙은 화장이나 복장이 아닌 상대방을 사랑하는 마음뿐이지요.\n그것 하나 만으로도 충분합니다.\n그러므로 자신의 마음대로 행동하세요.\n눈앞의 사랑을 더욱 진하게 만들 수 있습니다.");
        cards.put(4, "두 사람의 사랑은 이미 절정의 위치에 있으므로 별달리 신경 쓸 것은 없습니다.\n서로에게 무리되는 요구를 하지 않고 상대방을 배려하는 마음을 갖는다면 더욱 좋을 것입니다.\n다만 사랑의 표현을 조금 더 적극적으로 한다면 상대방 또한 그러할 것이며 이는 두 사람의 사이를 더욱 견고하게 만들어 주는 역할을 할 것이지요.\n상대방에 대한 자신의 감정을 숨기려 하지 말고 있는 그대로 표현해보세요.\n당신의 마음과 상대방의 마음이 서로 통해 있는 것을 분명 확인할 수 있을 것입니다.");
        cards.put(5, "인연은 예상보다 당신 가까이에 있었는지 모릅니다.\n열린 마음을 갖고 귀도 쫑긋 세워보세요.\n사랑이 서서히 당신에게 다가오는 날입니다.\n너무 시야를 멀리 하고 인연을 찾으려고만 하면 오히려 주변의 진정한 인연을 못 알아볼 수 있습니다.\n평소에 자신에게 호감을 가지고 있던 사람이 있다면 그 사람의 다른 면을 발견할 수도 있으며 인연으로 발전할 수도 있습니다.\n또한 사람에 대한 새로운 시각을 갖게 될 수 있습니다.\n아주 친근한 곳에서 당신의 인연이 당신을 바라보고 있는 날입니다.");
        cards.put(6, "작은 오해가 생길 수 있으니 이러한 오해를 미연에 방지하도록 하는 것이 중요하겠습니다.\n서로에 대한 지나친 관심이 때로는 의심으로도 이어질 수 있는 부분입니다.\n그러므로 서로에 대해서 조금은 여유로운 태도를 갖는 것이 중요합니다.\n너무 큰 기대는 실망을 부르기도 하며 상대방에게 못할 행동일 수 있습니다.\n특히 사소한 것이라도 거짓말을 하는 경우는 없도록 하는 것이 가장 필요합니다.\n무엇보다도 신뢰가 바탕이 되지 않으면 연인의 관계는 지속될 수 없는 것입니다.");
        cards.put(7, "상대방이 당신의 마음을 유난히 잘 알아주는 날이니 충돌과 마찰이 생길 여지가 없어 보이는군요.\n서로의 마음이 통한다는 말은 이때 쓰이는 것입니다.\n당신이 하고 싶은 말조차 상대방이 미리 알 수 있으니 이런 날일수록 상대방에게 기대는 모습을 보여줘도 괜찮을 듯싶습니다.\n또한 서로에게 어느 정도의 부담을 갖고 있었다면 그러한 것들을 깨끗이 정리할 수 있는 날이니 상대방을 편하게 대해 보도록 하십시오.\n당신의 노력만큼 그 이상으로 애정은 더욱 잘 풀려갈 것입니다.");
    }
}
