package card;
import java.util.HashMap;

public class MoneyCard extends Card {
    public MoneyCard(int num) {
        cardNum = num;
        cards = new HashMap<>();
        cards.put(1, "모든 조건이 다 당신이 하는 일이나 투자에 들어 맞을 수는 없겠습니다.\n하지만 당신의 능력과 운을 발휘하기엔 충분한 수준이라는 점을 잊지 마십시오.\n너무 무리한 목표를 가지고 일을 한다는 것은 결국 자신에게 스트레스로 돌아오기에 충분한 것입니다.\n상황을 보다 자신에게 유리하게 만들도록 자신의 능력을 발휘하는 것이 가장 필요한 때입니다.\n또한 조건적으로 안 좋은 부분이 있다면 자신의 노력으로 극복해보세요.\n버텨야 하는 날입니다.");
        cards.put(2, "오늘 재물의 열매를 볼 수 있을 것입니다.\n지금까지 열심히 일해 오는 동안 당신의 주위에 꾸준히 쌓아두었던 많은 노력들이 결실을 맺는 날입니다.\n힘들어서 좌절하고 포기하고 싶었던 순간들을 꿋꿋이 버텨온 만큼 그 이상의 대가가 보상으로 당신의 앞에 나타날 것입니다.\n또한 당신이 움직이는 만큼 당신에게 돈과 재물을 불러옵니다.\n이럴수록 좀 더 계획적인 자신만의 소신을 가지고 움직이세요.");
        cards.put(3, "가만히 앉아서 다른 사람의 이야기를 듣는 것보다 활발하게 움직이면 움직일수록 당신에게 돈이 되는 일이 많이 생길 것으로 보이는 하루예요.\n온라인에서 얻게 되는 정보가 밖에 나가서 발로 뛰어 얻은 정보의 양 보다 더 많을 것 같군요. 주식이나 매매는 큰 규모가 아니라면 투자해도 괜찮아 보입니다.\n오늘 같은 날에 창업을 꿈꾸는 사람에게는 더 없이 좋은 기운이 보이는 군요.");
        cards.put(4, "아직 목표한 것을 다 이루지는 못했습니다.\n하지만 당신에게 유리한 쪽으로 정책이 변경되었다는 희소식이 들려오니 다행이군요.\n이 기회를 잘 이용하는 것은 바로 당신의 능력 입니다.\n불안한 마음을 갖고 있다면 깔끔하게 없애는 것이 좋으며 조금은 여유로운 마음을 가지고 이익을 도모하도록 하는 것이 어느 때보다 좋은 하루 입니다.");
        cards.put(5, "친한 친구나 지인과의 금전 거래는 피해야 하는 날입니다\n감정만 상하게 되기 쉽습니다.\n꼭 꿔줘야 할 경우엔 주어도 아깝지 않을 액수만 내어주고 잊어버리도록 하세요.\n친구나 지인에 대한 믿음과 신뢰에도 악영향을 미칠 수 있기 때문입니다. 그로 인한 대비를 미리 해야 합니다.\n돈에 대한 생각을 잠시 잊어 버리는 것이 좋으며 자꾸 거래에 대한 생각을 하지 않도록 주의를 기울이는 것이 좋습니다.\n특히 공과 사를 구별하지 않으면 손실을 입게 됩니다.");
        cards.put(6, "굳이 많은 돈을 얻게 되거나 좋은 투자처를 발견하게 되는 등의 운보다는 물건을 사고 팔기 좋은 날 정도라고 예상해 보는 것이 맞을 듯 합니다.\n이런 저런 매매, 매수를 하다 보면 더 큰 기회가 올 것이니 시세 차익을 얻을 수 있습니다.\n의외로 목돈을 얻을 수 있는 확률도 없지는 않은 날이 될 것으로 보입니다.\n재물의 흐름이 좋고, 당신에게 행운을 가져다 주려 하고 있습니다.\n자신감을 가지고 활발하게 움직이세요.\n가까운 곳에서 재운을 찾아보는 것이 유리합니다.");
        cards.put(7, "주변 사람들의 도움으로 당신이 원하는 대로 재물을 얻을 수 있는 날입니다.\n평소 소장하고 싶은 물건을 구입하기에는 최적기 입니다.\n당신이 평소에 가보고 싶었던 곳이 있다면 오늘만큼은 다른 건 생각하지 않고 움직이는 것이 좋습니다.\n또한 당신 가족이나 친구들에 의해 좋은 정보를 많이 얻거나 직접적인 금전에 대한 부분에 이익을 얻을 수 있습니다.\n당신의 노력과 함께 주변의 조화가 예상되니 행운을 부르는 금전운이 눈 앞에 아른거리는 하루입니다.");
    }
}
