package card;
import java.util.HashMap;

public class TotalCard extends Card {
    public TotalCard(int num) {
        cardNum = num;
        cards = new HashMap<>();
        cards.put(1, "상쾌한 기분으로 하루를 열 수 있을 것이며 이러한 기분은 하루 종일 지속될 것입니다.\n회식이나 동창회 등의 모임 자리가 있다면 다른 일을 참석하는 게 좋겠어요.\n당신이 가는 곳에 당신의 행운이 기다리고 있다는 것을 기억하세요.\n가끔은 일상에서 벗어나 새로운 기분을 맞는 것도 나쁘지 않습니다.\n그렇기 때문에 자신의 일을 하는데 있어 여러가지 변화를 줄 수 있도록 하세요.\n그리고 그 변화에 당당히 대처하는 모습을 보인다면 당신에게 도움이 될만한 일들이 많이 있을 것이니 말이지요.");
        cards.put(2, "여러 가지 일에 지쳐 있었다면 오늘은 많은 지원을 받으면서 회복해 갈 수 있을 것으로 기대됩니다.\n당신을 힘들게 했던 많은 일들이 당신의 노력과 주변 사람들의 도움으로 깨끗하게 해결할 수 있습니다.\n그렇기 때문에 자신도 모르게 잃었던 자신감을 회복할 수 있으며 당당함을 느낄 수 있습니다.\n또한 평소에 친했던 사람을 찾아서 조언을 구해 보십시오.\n분명 정답에 가까운 말이 나올 테니까요.\n고맙게 그리고 잘 이용하도록 하세요.");
        cards.put(3, "손길이 닿는 곳마다 행운이 깃들 것이니 어려움 없는 날이 되리라 기대해도 좋습니다.\n자신이 생각하는 방향으로 천천히 나아간다면 별 다른 장애를 받지 않고 모든 일을 해결할 수 있습니다.\n자신 앞에 어려운 일이 놓여 있다고 하더라도 주변의 도움이나 조언을 통해 모든 악재를 제거할 수 있습니다.\n또한 자신 스스로도 발전하는 모습을 가질 수 있습니다.\n다만 모든 것에 있어서 너무 무리하지 말고 적정한 선에서 만족을 하고 조절할 수 있다면 더욱 좋다는 점 한가지만 기억해 두십시오.");
        cards.put(4, "어디선가 정기를 받은 듯 무기력했던 어제와는 다르게 많은 힘이 생기는 날입니다.\n좌절하고 싶었던 일들이 있었다면 뜻하지 않은 실마리를 찾아 좋게 좋게 풀어나갈 수 있는 날입니다.\n한층 밝아진 모습으로 모든 것을 대하기 때문에 자신에 대한 주변의 환경 또한 새롭게 느껴질 수 있습니다.\n자신의 능력을 과신하는 것은 좋지 않지만 어느정도 자신감을 가져도 좋은 시기입니다.\n평소에 미루어두었던 어려운 일을 맡아서 처리한다면 수월할 것이고 좋은 평가를 받을 수 있을 것으로 보입니다.");
        cards.put(5, "솔직한 대화가 당신에게 큰 힘이 되는 날입니다. 행운이 가득하니 용기를 내세요.\n적을 동지로 돌릴 수 있는 날입니다.\n평소에 알고 지내던 사이에 작은 갈등이나 오해가 있었다면 자신이 먼저 마음을 열고 다가가는 것도 좋으며 혹은 상대방쪽에서 자신에게 손을 내미는 일이 생길 수 있습니다.\n당신을 있는 그대로 솔직하게 표현하십시오.\n또한 작은 일에 연연하기보다는 큰 흐름에 집중하는 것이 좋겠군요.\n사소한 일보다는 큰 일에 신경을 쓰면서 일을 해나가세요.\n자신감을 가지고 움직이면 그만큼 힘이 납니다.");
        cards.put(6, "모든 일이 내 마음과 달리 엇나가는 경우가 생깁니다. 무엇 좀 하려하면 방해세력이 만만치 않습니다.\n생각지 못했던 곳에서의 방해공작으로 인해 마음이 다치는 경우도 생길 수 있습니다.\n그로 인해 스트레스가 발생할 수 있는데 이럴땐 조금만 여유로운 생각을 갖는 것이 중요합니다.\n조급한 마음을 가지면 일이 더욱 꼬이게 되니 마음을 비우세요.\n자신부터 마음을 비우고 행동하면 곧 방해에서 벗어나 자유로운 상황으로 나갈 수 있습니다.\n쓸데없는 욕심을 버리면 오히려 일의 해결이 한결 수월해집니다.");
        cards.put(7, "많은 사람들이 당신의 의견에 동조하고 굳이 말하지 않아도 당신에게 유리한 쪽으로의 선택과 행동을 할 것으로 보이는 날입니다.\n당신의 소신이 향하는 곳이 있다면 그 곳을 향해 도전하는 것이 좋습니다.\n주변 상황도 좋게 돌아가기 때문에 별 어려움 없이 일을 해나갈 수 있습니다.\n또한 칭찬이나 조언들이 잇따르니 자신에게도 이롭습니다.\n이런 날을 잘 활용하여서 더 높은 위치가 전진할 수 있도록 각고의 노력을 기해 보시기 바랍니다.");
    }
}
